In [1]:
import pandas as pd
import numpy as np

In [11]:
suppliers=pd.read_csv('./data/northwind/suppliers_del_1.csv',usecols=['SupplierID','CompanyName','City'])

In [15]:
products=pd.read_csv('./data/northwind/products_del_1.csv',usecols=['ProductID','ProductName','SupplierID'])

In [24]:
prod_and_sup=products.merge(suppliers,on='SupplierID')

In [25]:
prod_and_sup.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70 entries, 0 to 69
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ProductID    70 non-null     int64
 1   ProductName  70 non-null     object
 2   SupplierID   70 non-null     int64
 3   CompanyName  70 non-null     object
 4   City         70 non-null     object
dtypes: int64(2), object(3)
memory usage: 3.3+ KB

In [30]:
print(len(products),len(suppliers),len(prod_and_sup))

75 27 70

In [31]:
prod_and_sup.head()

,ProductID,ProductName,SupplierID,CompanyName,City
0,1,Chai,1,Exotic Liquids,London
1,2,Chang,1,Exotic Liquids,London
2,3,Aniseed Syrup,1,Exotic Liquids,London
3,4,Chef Anton's Cajun Seasoning,2,New Orleans Cajun Delights,New Orleans
4,5,Chef Anton's Gumbo Mix,2,New Orleans Cajun Delights,New Orleans

In [33]:
prod_and_sup_outer=products.merge(suppliers,on='SupplierID',how='outer',indicator=True)
filter=prod_and_sup_outer['_merge']=='left_only'

In [34]:
prod_and_sup_outer[filter]

    ProductID          ProductName  SupplierID CompanyName City     _merge
27       22.0  Gustaf's Knäckebröd           9         NaN  NaN  left_only
28       23.0             Tunnbröd           9         NaN  NaN  left_only
48       36.0          Inlagd Sill          17         NaN  NaN  left_only
49       37.0           Gravad lax          17         NaN  NaN  left_only
50       73.0           Röd Kaviar          17         NaN  NaN  left_only

In [35]:
filter2=prod_and_sup_outer['_merge']=='right_only'

In [36]:
prod_and_sup_outer[filter2]

,ProductID,ProductName,SupplierID,CompanyName,City,_merge
75,NaN,NaN,27,Escargots Nouveaux,Montceau,right_only